Repository: Kalhara926/EV
Catalog: lib/l10n/app_*.arb
Languages: si, ta

# loginTitle
source: Login
si: ඇතුල් වන්න
ta: உள்நுழை

# usernameHint
source: Username
si: පරිශීලක නාමය
ta: பயனர்பெயர்

# passwordHint
source: Password
si: මුරපදය
ta: கடவுச்சொல்

source: Remember Me
si: මාව මතක තබාගන්න
ta: என்னை நினைவில் கொள்

source: Forgot Password?
si: මුරපදය අමතකද?
ta: கடவுச்சொல்லை மறந்தீர்களா?

# orText
source: OR
si: හෝ
ta: அல்லது

source: Login with Google
si: Google සමඟින් ඇතුල් වන්න
ta: Google மூலம் உள்நுழைக

source: Sign in with Apple
si: Apple සමඟින් ඇතුල් වන්න
ta: Apple மூலம் உள்நுழைக

# newUserPrompt
source: New to this app?
si: මෙම යෙදුමට අලුත්ද?
ta: இந்தப் பயன்பாட்டிற்கு புதியவரா?

# signUpNow
source: Sign-Up
si: ලියාපදිංචි වන්න
ta: பதிவு செய்க

source: Hello,
si: ආයුබෝවන්,
ta: வணக்கம்,

source: Charge Now!
si: දැන් චාජ් කරන්න!
ta: இப்போது சார்ஜ் செய்!

# scanQrPrompt
source: Scan QR to start your charging session
si: චාජ් කිරීම ආරම්භ කිරීමට QR කේතය ස්කෑන් කරන්න
ta: சார்ஜ் செய்ய QR குறியீட்டை ஸ்கேன் செய்யவும்

source: Your Current EV Points:
si: ඔබගේ EV පොයින්ට්ස්:
ta: உங்கள் EV புள்ளிகள்:

# oneEvPointEquals
source: 1 EV Point = 1 Rupee
si: EV පොයින්ට් 1 = රුපියල් 1
ta: 1 EV புள்ளி = 1 ரூபாய்

source: Quick Actions
si: ඉක්මන් ක්‍රියා
ta: விரைவு நடவடிக்கைகள்

source: Stations
si: ස්ථාන
ta: நிலையங்கள்

source: My Vehicle
si: මගේ වාහනය
ta: என் வாகனம்

source: History
si: ඉතිහාසය
ta: வரலாறு

source: CHARGING IN PROGRESS
si: චාජ් වෙමින් පවතී
ta: சார்ஜ் ஆகிறது

# finishesAround
source: Finishes around {time}
si: අවසන් වන්නේ {time} ට පමණ
ta: சுமார் {time} மணிக்கு முடிவடையும்

source: View
si: නරඹන්න
ta: பார்

# drawerHome
source: Home
si: මුල් පිටුව
ta: முகப்பு

# drawerAboutUs
source: About Us
si: අපි ගැන
ta: எங்களை பற்றி

# drawerPrivacyPolicy
source: Privacy Policy
si: පෞද්ගලිකත්ව ප්‍රතිපත්තිය
ta: தனியுரிமைக் கொள்கை

# drawerTerms
source: Terms and Conditions
si: කොන්දේසි සහ නියමයන්
ta: விதிமுறைகளும் நிபந்தனைகளும்

source: Sign Out
si: ඉවත් වන්න
ta: வெளியேறு

source: Registration Failed
si: ලියාපදිංචිය අසාර්ථකයි
ta: பதிவு தோல்வியடைந்தது

source: Passwords don't match!
si: මුරපද නොගැලපේ!
ta: கடவுச்சொற்கள் பொருந்தவில்லை!

# createAccountTitle
source: Let's create an account for you
si: අපි ඔබ වෙනුවෙන් ගිණුමක් හදමු
ta: உங்களுக்காக ஒரு கணக்கை உருவாக்குவோம்

# firstNameHint
source: First Name
si: මුල් නම
ta: முதல் பெயர்

# lastNameHint
source: Last Name
si: වාසගම
ta: கடைசி பெயர்

# emailHint
source: Email
si: විද්‍යුත් තැපෑල
ta: மின்னஞ்சல்

# confirmPasswordHint
source: Confirm Password
si: මුරපදය තහවුරු කරන්න
ta: கடவுச்சொல்லை உறுதிப்படுத்தவும்

# signUpButton
source: Sign Up
si: ලියාපදිංචි වන්න
ta: பதிவு செய்க

# alreadyHaveAccount
source: Already have an account?
si: දැනටමත් ගිණුමක් තිබේද?
ta: ஏற்கனவே கணக்கு உள்ளதா?

source: Login now
si: දැන් ඇතුල් වන්න
ta: இப்போது உள்நுழையவும்

# myVehiclesTitle
source: My Vehicles
si: මගේ වාහන
ta: எனது வாகனங்கள்

# deleteVehicleTitle
source: Delete Vehicle
si: වාහනය මකන්න
ta: வாகனத்தை நீக்கு

# deleteVehicleConfirm
source: Are you sure you want to delete this vehicle?
si: ඔබට මෙම වාහනය මැකීමට අවශ්‍ය බව විශ්වාසද?
ta: இந்த வாகனத்தை நீக்க விரும்புகிறீர்களா?

source: Cancel
si: අවලංගු කරන්න
ta: ரத்துசெய்

source: Delete
si: මකන්න
ta: நீக்கு

source: Vehicle deleted.
si: වාහනය සාර්ථකව මකා දමන ලදී.
ta: வாகனம் நீக்கப்பட்டது.

# errorDeletingVehicle
source: Error deleting vehicle: {error}
si: වාහනය මැකීමේදී දෝෂයක් ඇතිවිය: {error}
ta: வாகனத்தை நீக்குவதில் பிழை: {error}

source: No vehicles found!
si: වාහන කිසිවක් හමු නොවීය!
ta: வாகனங்கள் எதுவும் இல்லை!

# addFirstVehiclePrompt
source: Add your first EV to get started.
si: ආරම්භ කිරීමට ඔබගේ පළමු විදුලි වාහනය ඇතුළත් කරන්න.
ta: தொடங்குவதற்கு உங்கள் முதல் மின்சார வாகனத்தைச் சேர்க்கவும்.

source: Add Your First Vehicle
si: ඔබගේ පළමු වාහනය ඇතුළත් කරන්න
ta: உங்கள் முதல் வாகனத்தைச் சேர்க்கவும்

source: Add Vehicle
si: වාහනයක් එක් කරන්න
ta: வாகனத்தைச் சேர்

source: Edit
si: වෙනස් කරන්න
ta: திருத்து

source: License Plate
si: බලපත්‍ර තහඩුව
ta: உரிமத் தட்டு

source: Battery Capacity
si: බැටරි ධාරිතාව
ta: மின்கலத் திறன்

source: Charging Port
si: චාජ් කරන පෝට් එක
ta: சார்ஜிங் போர்ட்

# addNewVehicleTitle
source: Add New Vehicle
si: අලුත් වාහනයක් එක් කරන්න
ta: புதிய வாகனத்தைச் சேர்

# editVehicleTitle
source: Edit Vehicle
si: වාහනයේ විස්තර වෙනස් කරන්න
ta: வாகனத்தைத் திருத்து

# makeHint
source: Make (e.g., Tesla)
si: වර්ගය (උදා: Tesla)
ta: தயாரிப்பு (எ.கா., டெஸ்லா)

# modelHint
source: Model (e.g., Model 3)
si: මාදිලිය (උදා: Model 3)
ta: மாடல் (எ.கா., மாடல் 3)

# yearHint
source: Year
si: වර්ෂය
ta: ஆண்டு

# batteryCapacityHint
source: Battery Capacity (e.g., 75 kWh)
si: බැටරි ධාරිතාව (උදා: 75 kWh)
ta: மின்கலத் திறன் (எ.கா., 75 kWh)

source: Charging Port Type
si: චාජ් කරන පෝට් වර්ගය
ta: சார்ஜிங் போர்ட் வகை

# specifyOtherPort
source: Specify Other Port Type
si: වෙනත් පෝට් වර්ගයක් නම් සඳහන් කරන්න
ta: பிற போர்ட் வகையைக் குறிப்பிடவும்

# pleaseSelectType
source: Please select a type
si: කරුණාකර වර්ගයක් තෝරන්න
ta: ஒரு வகையைத் தேர்ந்தெடுக்கவும்

# fieldCannotBeEmpty
source: This field cannot be empty
si: මෙම කොටස හිස්ව තැබිය නොහැක
ta: இந்தப் புலம் காலியாக இருக்கக்கூடாது

source: Save Changes
si: වෙනස්කම් සුරකින්න
ta: மாற்றங்களைச் சேமி

# myWalletTitle
source: My Wallet
si: මගේ Wallet එක
ta: எனது Wallet

source: Available EV Points
si: ලබාගත හැකි EV Points
ta: கிடைக்கும் EV புள்ளிகள்

source: Top Up Your Wallet
si: ඔබගේ Wallet එක Top Up කරන්න
ta: உங்கள் Wallet-ஐ Top Up செய்யவும்

source: Enter Amount (Points)
si: මුදල (Points) ඇතුළත් කරන්න
ta: தொகையை (புள்ளிகள்) உள்ளிடவும்

source: Proceed to Pay
si: ගෙවීමට ඉදිරියට යන්න
ta: பணம் செலுத்த தொடரவும்

source: Transaction History
si: ගනුදෙනු ඉතිහාසය
ta: பரிவர்த்தனை வரலாறு

source: View All
si: සියල්ල බලන්න
ta: அனைத்தையும் காட்டு

source: No recent transactions.
si: මෑත ගනුදෙනු නොමැත.
ta: சமீபத்திய பரிவர்த்தனைகள் இல்லை.

# topUpSuccess
source: {amount} points added successfully!
si: පොයින්ට්ස් {amount} ක් සාර්ථකව එකතු කරන ලදී!
ta: {amount} புள்ளிகள் வெற்றிகரமாக சேர்க்கப்பட்டன!

# topUpFailed
source: Failed to top up: {error}
si: Top Up කිරීම අසාර්ථක විය: {error}
ta: Top Up தோல்வியடைந்தது: {error}

# pleaseEnterValidAmount
source: Please enter a valid amount.
si: කරුණාකර වලංගු මුදලක් ඇතුළත් කරන්න.
ta: தயவுசெய்து சரியான தொகையை உள்ளிடவும்.

# selectChargingTimeTitle
source: Select Charging Time
si: චාජ් කරන වේලාව තෝරන්න
ta: சார்ஜிங் நேரத்தைத் தேர்ந்தெடுக்கவும்

source: Connected Charger
si: සම්බන්ධිත චාජරය
ta: இணைக்கப்பட்ட சார்ஜர்

source: Ready for charging
si: චාජ් කිරීමට සූදානම්
ta: சார்ஜ் செய்யத் தயார்

# howLongToCharge
source: How long do you want to charge?
si: ඔබට කොපමණ වේලාවක් චාජ් කිරීමට අවශ්‍යද?
ta: எவ்வளவு நேரம் சார்ஜ் செய்ய விரும்புகிறீர்கள்?

# minutes
source: {count} Minutes
si: මිනිත්තු {count}
ta: {count} நிமிடங்கள்

source: Charging Summary
si: චාජ් කිරීමේ සාරාංශය
ta: சார்ஜிங் சுருக்கம்

source: Duration
si: කාලය
ta: கால அளவு

source: EV Points Required
si: අවශ්‍ය EV පොයින්ට්ස්
ta: தேவையான EV புள்ளிகள்

source: Estimated Cost
si: ඇස්තමේන්තුගත පිරිවැය
ta: மதிப்பிடப்பட்ட செலவு

source: Proceed to Payment
si: ගෙවීමට ඉදිරියට යන්න
ta: பணம் செலுத்த தொடரவும்

# pleaseSelectValidDuration
source: Please select a valid duration.
si: කරුණාකර වලංගු කාල සීමාවක් තෝරන්න.
ta: சரியான கால அளவைத் தேர்ந்தெடுக்கவும்.

# chargingSessionTitle
source: Charging Session
si: චාජ් කිරීමේ සැසිය
ta: சார்ஜிங் அமர்வு

source: Your Session Details
si: ඔබගේ සැසියේ විස්තර
ta: உங்கள் அமர்வு விவரங்கள்

# yourAvailablePoints
source: Your Available Points: {count}
si: ඔබගේ පවතින පොයින්ට්ස්: {count}
ta: கிடைக்கும் புள்ளிகள்: {count}

# confirmAndPay
source: Confirm & Pay
si: තහවුරු කර ගෙවන්න
ta: உறுதிசெய்து பணம் செலுத்து

# payRemaining
source: Pay Remaining to Proceed
si: ඉතිරිය ගෙවා ඉදිරියට යන්න
ta: மீதமுள்ளதை செலுத்தி தொடரவும்

source: Start Charging Now
si: දැන් චාජ් කිරීම ආරම්භ කරන්න
ta: இப்போது சார்ஜ் செய்யத் தொடங்கு

# chargingInProgressTitle
source: Charging in Progress
si: චාජ් වෙමින් පවතී
ta: சார்ஜ் ஆகிறது

source: Time Left
si: ඉතිරි කාලය
ta: மீதமுள்ள நேரம்

source: Volts
si: වෝල්ට්
ta: வோல்ட்ஸ்

source: Amps
si: ඇම්ප්ස්
ta: ஆம்ப்ஸ்

source: Stop Charging
si: චාජ් කිරීම නවත්වන්න
ta: சார்ஜ் செய்வதை நிறுத்து

# paymentConfirmed
source: Payment Confirmed! You can now start charging.
si: ගෙවීම තහවුරු කරන ලදී! දැන් ඔබට චාජ් කිරීම ආරම්භ කළ හැකිය.
ta: பணம் செலுத்துதல் உறுதிசெய்யப்பட்டது! இப்போது நீங்கள் சார்ஜ் செய்யத் தொடங்கலாம்.

# paymentFailed
source: Payment Failed: {error}
si: ගෙවීම අසාර්ථක විය: {error}
ta: பணம் செலுத்துதல் தோல்வியடைந்தது: {error}

source: Charging stopped.
si: චාජ් කිරීම නවත්වන ලදී.
ta: சார்ஜ் செய்வது நிறுத்தப்பட்டது.

source: Charging Complete!
si: චාජ් කිරීම සම්පූර්ණයි!
ta: சார்ஜிங் முடிந்தது!

# profileTitle
source: Profile
si: පැතිකඩ
ta: சுயவிவரம்

source: Edit Profile
si: පැතිකඩ සංස්කරණය කරන්න
ta: சுயவிவரத்தைத் திருத்து

source: Settings
si: සැකසුම්
ta: அமைப்புகள்

source: Logout
si: ඉවත් වන්න
ta: வெளியேறு

source: Language
si: භාෂාව
ta: மொழி

# selectLanguage
source: Select your preferred language
si: ඔබ කැමති භාෂාව තෝරන්න
ta: உங்களுக்கு விருப்பமான மொழியைத் தேர்ந்தெடுக்கவும்

source: Customer Support
si: පාරිභෝගික සේවය
ta: வாடிக்கையாளர் ஆதரவு

# callHotline
source: Call Our Hotline
si: අපගේ ක්ෂණික ඇමතුම් අංකය අමතන්න
ta: எங்கள் ஹாட்லைனை அழைக்கவும்

source: Our Address
si: අපගේ ලිපිනය
ta: எங்கள் முகவரி

# addressLine
source: No. 123, Galle Road, Colombo 03, Sri Lanka
si: අංක 123, ගාලු පාර, කොළඹ 03, ශ්‍රී ලංකාව
ta: இல. 123, காலி வீதி, கொழும்பு 03, இலங்கை

# sendFeedback
source: Send Feedback or Complaint
si: යෝජනා / පැමිණිලි ඉදිරිපත් කරන්න
ta: கருத்து அல்லது புகாரை அனுப்பவும்

# feedbackHint
source: Type your message here...
si: ඔබගේ පණිවිඩය මෙහි ටයිප් කරන්න...
ta: உங்கள் செய்தியை இங்கே தட்டச்சு செய்யவும்...

source: Submit
si: ඉදිරිපත් කරන්න
ta: சமர்ப்பி

# feedbackSuccess
source: Feedback submitted successfully!
si: ඔබගේ අදහස සාර්ථකව ඉදිරිපත් කරන ලදී!
ta: கருத்து வெற்றிகரமாக சமர்ப்பிக்கப்பட்டது!

# feedbackFailed
source: Failed to submit feedback: {error}
si: අදහස ඉදිරිපත් කිරීම අසාර්ථක විය: {error}
ta: கருத்தை சமர்ப்பிக்கத் தவறிவிட்டது: {error}

# mobileNumberHint
source: Mobile Number
si: දුරකථන අංකය
ta: மொபைல் எண்

# profileUpdatedSuccess
source: Profile updated successfully!
si: පැතිකඩ සාර්ථකව යාවත්කාලීන කරන ලදී!
ta: சுயவிவரம் வெற்றிகரமாகப் புதுப்பிக்கப்பட்டது!

# profileUpdateFailed
source: Failed to update profile: {error}
si: පැතිකඩ යාවත්කාලීන කිරීමට අසමත් විය: {error}
ta: சுயவிவரத்தைப் புதுப்பிக்கத் தவறிவிட்டது: {error}

# tapToChange
source: Tap image to change
si: වෙනස් කිරීමට පින්තූරය මත තට්ටු කරන්න
ta: மாற்ற படத்தை தட்டவும்

# signUpTitle
source: Sign-Up
si: ලියාපදිංචි වන්න
ta: பதிவு செய்க

source: Personal
si: පෞද්ගලික
ta: தனிப்பட்ட

source: Security
si: ආරක්ෂාව
ta: பாதுகாப்பு

source: Company
si: සමාගම
ta: நிறுவனம்

source: Country
si: රට
ta: நாடு

source: Company Name
si: සමාගමේ නම
ta: நிறுவனத்தின் பெயர்

source: Sri Lanka
si: ශ්‍රී ලංකාව
ta: இலங்கை

# findStationsTitle
source: Find Stations
si: චාජ් කරන ස්ථාන සොයන්න
ta: நிலையங்களைக் கண்டறியவும்

# stationsNearYou
source: Stations Near You ({distance}km)
si: ඔබ අසල ඇති ස්ථාන ({distance}km)
ta: உங்களுக்கு அருகிலுள்ள நிலையங்கள் ({distance}km)

# noStationsNearby
source: No stations found within {distance}km radius.
si: කිලෝමීටර {distance} ක අරයක් තුළ ස්ථාන හමු නොවීය.
ta: {distance}km சுற்றளவில் நிலையங்கள் எதுவும் இல்லை.

source: Get Directions
si: මාර්ග උපදෙස් ලබා ගන්න
ta: திசைகளைப் பெறுக

# chargingHistoryTitle
source: Charging History
si: චාජ් කිරීමේ ඉතිහාසය
ta: சார்ஜிங் வரலாறு

# noChargingHistory
source: No Charging History Yet!
si: තවමත් චාජ් කිරීමේ ඉතිහාසයක් නොමැත!
ta: இன்னும் சார்ஜிங் வரலாறு இல்லை!

# pastSessionsAppearHere
source: Your past charging sessions will appear here.
si: ඔබගේ පැරණි චාජ් කිරීමේ සැසි මෙහි දිස්වනු ඇත.
ta: உங்கள் கடந்தகால சார்ஜிங் அமர்வுகள் இங்கே தோன்றும்.

# startNewCharge
source: Start a New Charge
si: අලුත් චාජ් කිරීමක් ආරම්භ කරන්න
ta: புதிய சார்ஜிங்கைத் தொடங்கு

source: Energy
si: බලශක්තිය
ta: ஆற்றல்

source: Cost
si: පිරිවැය
ta: செலவு
